
&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	РасчитатьНДС();
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьНДС()
	ОбщаяСумма =  Объект.Товары.Итог("Сумма");
	Объект.ОбщаяСуммаДоНДС = ОбщаяСумма;
	Объект.НДС = ОбщаяСумма*ПолучитьНДС();
	Объект.СуммаСНДС = ОбщаяСумма - Объект.НДС; 
КонецПроцедуры   

Функция ПолучитьНДС()
	Возврат Константы.ПроцентНДС.Получить()/100;
КонецФункции

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
    РасчитатьНДССтроки();
	РасчитатьНДС();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчитатьНДССтроки();
	РасчитатьНДС();
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьНДССтроки()
	текСтрока = Элементы.Товары.ТекущиеДанные;
	текСтрока.Сумма = текСтрока.Количество * текСтрока.Цена;
	текСтрока.НДС = текСтрока.Сумма * ПолучитьНДС();
	текСтрока.СуммаСНДС = текСтрока.Сумма - текСтрока.НДС;
КонецПроцедуры